l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/stm/stm32f1_3_flash.c
/*
 * Copyright (C) 2010 by Ulrich Prinz (uprinz2@netscape.net)
 * Copyright (C) 2010 by Rittal GmbH & Co. KG. All rights reserved.
 * Copyright (C) 2012, 2013, 2017 Uwe Bonnes
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. Neither the name of the copyright holders nor the names of
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF
 * THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 *
 * For additional information see http://www.ethernut.de/
 *
 */

#include <stdint.h>
#include <string.h>

#include <cfg/arch.h>
#include <cfg/memory.h>
#include <cfg/eeprom.h>
#include <sys/nutdebug.h>
#include <sys/heap.h>
#include <dev/iap_flash.h>

uint32_t program_end_raw;

#if defined (MCU_STM32F0)
# if  defined(STM32F030xC) ||  defined(STM32F070xB) || \
    defined(STM32F071xB) || defined(STM32F072xB) || defined(STM32F078xx) || \
    defined(STM32F091xC) || defined(STM32F098xx)
#  define FLASH_PAGE_SIZE (1 << 11)
# else
#  define FLASH_PAGE_SIZE 1024
# endif
# if  defined(STM32F030xC) || defined(STM32F091xC)
static uint32_t pagelist[4];
# else
/* Lets waste one word here. So no need to break down further*/
static uint32_t pagelist[2];
# endif
#elif defined(MCU_STM32F1)
# if defined (MCU_STM32F1_LD) || defined (MCU_STM32F1_LD_VL)
#  define FLASH_PAGE_SIZE 1024
   static uint32_t pagelist[1];
# elif defined (MCU_STM32F1_MD) || defined(MCU_STM32F1_MD_VL)
#  define FLASH_PAGE_SIZE 1024
   static uint32_t pagelist[4];
# elif defined (MCU_STM32F1_HD) || defined (MCU_STM32F1_HD_VL) ||\
    defined (MCU_STM32F1_CL)
#  define FLASH_PAGE_SIZE 2048
   static uint32_t pagelist[8];
# elif defined(MCU_STM32F1_XL)
#  define FLASH_PAGE_SIZE 2048
   static uint32_t pagelist[16];
# endif
#elif defined(MCU_STM32F3)
# define FLASH_PAGE_SIZE 2048
  static uint32_t pagelist[4];
#else
# warning Unknown STM32 Type
#endif

#define ERASED_PATTERN_16 0xffff
#define FLASH_ACCESS_SIZE 2

#ifndef FLASH_CONF_SIZE
#define FLASH_CONF_SIZE         FLASH_PAGE_SIZE
#elif  ((FLASH_CONF_SIZE != 256) && (FLASH_CONF_SIZE != 512) && \
        (FLASH_CONF_SIZE != 1024) && (FLASH_CONF_SIZE != 2048) && \
        (FLASH_CONF_SIZE != 4096) && (FLASH_CONF_SIZE != 8192))
#error FLASH_CONF_SIZE has to be either FLASH_PAGE_SIZE (default), 256, 512, 1024, 2048, 4096 or 8192
#endif

#define FLASH_PAGE_MASK (~(FLASH_PAGE_SIZE - 1))

#if !defined(RDP_KEY)
#define RDP_KEY 0x00aa;
#endif

#if !defined(FLASH_KEY1)
#define FLASH_KEY1 0x45670123L
#endif
#if !defined(FLASH_KEY2)
#define FLASH_KEY2 0xCDEF89ABL
#endif
#if !defined(FLASH_OPTKEY1)
#define FLASH_OPTKEY1 0x08192A3B
#endif
#if !defined(FLASH_OPTKEY2)
#define FLASH_OPTKEY2 0x4C5D6E7F
#endif

#if !defined(FLASH_SR_WRPRTERR) && defined(FLASH_SR_WRPERR)
#define FLASH_SR_WRPRTERR FLASH_SR_WRPERR
#endif

void FlashUntouch(void)
{
    int i;
    for (i = 0; i< sizeof(pagelist)/4; i++)
        pagelist[i] = 0;
}

static size_t FlashEnd(void)
{
    uint16_t size;
    size = *(uint16_t *) FLASHSIZE_BASE;
    return FLASH_BASE - 1 + size * 1024;
}

/*!
  * \brief  Returns the FLASH Status.
  *
  * \retval FLASH Status: FLASH_COMPLETE or appropriate error.
  */
static FLASH_Status FLASH_GetStatus(void)
{
    FLASH_Status rs = FLASH_COMPLETE;

    /* Decode the Flash Status */
    if (FLASH->SR & FLASH_SR_WRPRTERR)
        rs = FLASH_ERROR_WRP;
    else if (FLASH->SR & FLASH_SR_PGERR) {
        rs = FLASH_ERROR_PG;
        FLASH->CR = 0; /* Reset STRT */
    }
    else if (FLASH->SR & FLASH_SR_BSY)
        rs = FLASH_BUSY;
    FLASH->SR =  FLASH_SR_EOP | FLASH_SR_WRPRTERR | FLASH_SR_PGERR;

#if defined(MCU_STM32F1_XL)
    /* Decode the Flash Status */
    if (FLASH->SR2 & FLASH_SR_WRPRTERR)
        rs |= FLASH_ERROR_WRP;
    else if (FLASH->SR2 & FLASH_SR_PGERR)
        rs |= FLASH_ERROR_PG;
    else if (FLASH->SR2 & FLASH_SR_BSY)
        rs |= FLASH_BUSY;
#endif /* MCU_STM32F1_XL */

     /* Return the Flash Status */
    return rs;
}

/*!
  * \brief  Waits for a Flash operation to complete
  *
  * \retval FLASH Status: FLASH_COMPLETE or appropriate error.
  * Every flash access stalls while FLASH erase/program is running
  * The erase/program process however will finish at some point
  * and may indicate failure then
  */
static FLASH_Status FlashWaitReady(void)
{
    FLASH_Status status;
    do
        status = FLASH_GetStatus();
    while(status == FLASH_BUSY);
    /* Return the operation status */
    return status;
}

/*!
 * \brief Erase FLASH Page at specified address.
 *
 * This routine is called by Stm32FlashWritePage to erase
 * before programming.
 *
 * \param page Page to erase.
 *
 * \return FLASH Status.
 *
 * Even for page erase, AR takes the memory address while
 * rm0316 ands pm0075 tell about the page as argument
 */
static FLASH_Status FlashErasePage(uint32_t mem)
{
    FLASH_Status rs = FLASH_COMPLETE;

