l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/stm/stm32f1_3_flash.c
    uint32_t current_page = ((uint32_t)mem - FLASH_BASE)/FLASH_PAGE_SIZE;
    uint32_t pagestart, pageend, *pagemem;

    /* Check if page is erased */
    pagestart = mem & FLASH_PAGE_MASK;
    pageend   =  pagestart + FLASH_PAGE_SIZE;
    for(pagemem = (uint32_t*) pagestart; (uint32_t)pagemem < pageend; pagemem++) {
        if (*pagemem != ((ERASED_PATTERN_16 << 16) | ERASED_PATTERN_16))
            break;
        }
    if ((uint32_t) pagemem >= pageend)
        goto erase_done;
    /* Wait for last operation to be completed */
    rs = FlashWaitReady();
    if(rs == FLASH_COMPLETE) {
#if defined(MCU_STM32F1_XL)
        if ((current_page / FLASH_PAGE_SIZE) >255) {
            FLASH->CR2 = FLASH_CR_PER;
            FLASH->AR2 = mem;
            FLASH->CR2 = FLASH_CR_PER | FLASH_CR_STRT;
            rs = FlashWaitReady();
            FLASH->CR2 = 0;
            goto erase_done;
        }
#endif

        /* if the previous operation is completed, proceed to erase the page */
        FLASH->CR = FLASH_CR_PER;
        FLASH->AR = mem;
        FLASH->CR = FLASH_CR_PER | FLASH_CR_STRT;
        rs = FlashWaitReady();
        FLASH->CR = 0;
    }
erase_done:
    if (rs != FLASH_COMPLETE)
        pagelist[current_page/32] &= ~(1 <<(current_page%32));
    else
        pagelist[current_page/32] |= (1 <<(current_page%32));
    /* Return the Erase Status */
    return rs;
}

/*!
 * \brief Program any data to FLASH.
 *
 * This function writes data from source address to FLASH.
 *
 * \param dst Pointer to address anywhere in FLASH. Must be word
 *        aligned
 * \param src Pointer to source data. With SRC == NULL, the region
 *        is checked for write protection
 * \param len Number of bytes to be written/checked. Must be even.
 *
 * \return FLASH Status: FLASH_COMPLETE or appropriate error.
 */
static FLASH_Status FlashWrite( void* dst, const void* src, size_t len,
                            FLASH_ERASE_MODE mode)
{
    FLASH_Status rs = FLASH_COMPLETE;
    uint32_t wrpr = FLASH->WRPR; /* Old write protection state */
    uint32_t page_start, page_end;
    int i;
    void *wptr = dst;
    const void *rptr = src;
    uint32_t length = len;
    if (len == 0)
        return FLASH_COMPLETE;

    /* Check boundaries */
    if ((((uint32_t)dst + len - 1) > FlashEnd()) || ((uint32_t)dst < FLASH_BASE)) {
        return FLASH_BOUNDARY;
    }

    /* Check for write protected sectors */
    page_start = ((uint32_t)dst        - FLASH_BASE)/FLASH_PAGE_SIZE;
    page_end = (((uint32_t)dst + len -1) - FLASH_BASE)/FLASH_PAGE_SIZE;
    /* Write protection happens in 4 kiByte unites. The uppermost bit in
       FLASH->WRPR handles all remaining units*/
#if  FLASH_PAGE_SIZE  == 1024
    for (i = page_start>>2; i <= page_end>>2; i++)
#else
    for (i = page_start>>1; i <= page_end>>1; i++)
#endif
        if (((i < 31) && ((wrpr & (1<<i)) == 0)) || ((i >= 31) && (wrpr & 0x80000000) == 0))
                return FLASH_ERROR_WRP;
    if (src == NULL)
        /* Only a check for write protection was requested */
        return  FLASH_COMPLETE;

    /* Unlock related banks*/
    if (((uint32_t)dst - FLASH_BASE)/FLASH_PAGE_SIZE <256) {
        FLASH->KEYR = FLASH_KEY1;
        FLASH->KEYR = FLASH_KEY2;
        rs = FLASH->CR & FLASH_CR_LOCK;
    }
#if defined(MCU_STM32F1_XL)
    if (((uint32_t)dst + len - FLASH_BASE)/FLASH_PAGE_SIZE > 255) {
        FLASH->KEYR2 = FLASH_KEY1;
        FLASH->KEYR2 = FLASH_KEY2;
        rs |= FLASH->SR2;
    }
#endif
    if (rs != FLASH_COMPLETE)
        return FLASH_LOCKED;
    while (length && (rs == FLASH_COMPLETE))
    {
        uint32_t current_page = ((uint32_t)wptr - FLASH_BASE)/FLASH_PAGE_SIZE;
        uint32_t current_length = length;
        uint32_t offset_in_page = (uint32_t)wptr % FLASH_PAGE_SIZE;
        int prepend = 0, append = 0;
        uint16_t prepend_data = 0, append_data = 0;

        /* Check if page needs erase*/
        if ((mode == FLASH_ERASE_ALWAYS) ||
            ((mode == FLASH_ERASE_FIRST_TOUCH) &&
             (((pagelist[current_page/32] & (1 <<(current_page%32))) == 0)))) {
            if (i < (FLASH_PAGE_SIZE>>1)) {
                rs = FlashErasePage((uint32_t)wptr);
                if (rs != FLASH_COMPLETE)
                    /* Erase failed for any reason */
                    goto done;
            }
        }
        if (length > FLASH_PAGE_SIZE)
            current_length = FLASH_PAGE_SIZE;
        length -= current_length;
        prepend = (offset_in_page & 1);
        if (prepend) {
            uint8_t saved_data = *(uint8_t*)wptr;
            if (saved_data != (ERASED_PATTERN_16 & 0xff))
                return FLASH_ERR_ALIGNMENT;
            prepend_data = (*(uint8_t*)( rptr)<< 8) | (*(uint8_t *)wptr);
        }
        else {
            append  = (current_length &1);
            if(append) {
                uint8_t saved_data = *(uint8_t*)( wptr + current_length );
                if (saved_data != (ERASED_PATTERN_16 & 0xff))
                    return FLASH_ERR_ALIGNMENT;
                append_data  = *(uint8_t*)( rptr + current_length -1) | (saved_data << 8);
            }
        }
        /* Program the sector */
        rs = FlashWaitReady();
        if (rs != FLASH_COMPLETE)
            goto done;
        if (((uint32_t)wptr -FLASH_BASE)/FLASH_PAGE_SIZE <256)
            FLASH->CR = FLASH_CR_PG;
#if defined(MCU_STM32F1_XL)
        else
            FLASH->CR2 = FLASH_CR_PG;
#endif
        if (prepend) {
            if(prepend_data != ERASED_PATTERN_16)
                *(volatile uint16_t*)((uint32_t)wptr & ~1) = prepend_data;
            current_length -= 1;
            wptr += 1;
            rptr += 1;
        }
        while (current_length > 1 && (rs == FLASH_COMPLETE)) {
            rs = FlashWaitReady();
            if(*(volatile uint16_t*)rptr != ERASED_PATTERN_16)
                *(volatile uint16_t*)wptr = *(volatile uint16_t*)rptr;
            current_length -=2;
            wptr += 2;
            rptr += 2;
        }
        if (append) {
            if(append_data != ERASED_PATTERN_16)
                *(volatile uint16_t*)(wptr) = append_data;
            current_length -= 1;
            wptr += 1;
            rptr += 1;
        }
        rs = FlashWaitReady();
        FLASH->CR = 0;
        if(rs != FLASH_COMPLETE)
            goto done;
    }
    rs = FlashWaitReady();
    /* Check the written data */
    wptr = dst;
    rptr = src;
    length = len;
    /* Align flash access to 4 Byte Boundary*/
    while (length && ((uint32_t)wptr & 3)) {
        if(*(volatile uint8_t*)wptr++ != *(uint8_t*)rptr++)
            goto cmp_err;
        length--;
    }
    /* Now compare word at a time*/
    while (length > 3) {
        if(*(volatile uint32_t*)wptr != *(uint32_t*)rptr)
            goto cmp_err;
        length -= 4;
        wptr += +4;
        rptr += +4;
    }
    /* Compare the rest */
    while (length) {
        if((*(volatile uint8_t*)wptr++) != *(uint8_t*)rptr++)
            goto cmp_err;
        length--;
    }
    goto done;
cmp_err:
    rs = FLASH_COMPARE;

done:
    /* Lock the FLASH again */
    FLASH->CR = FLASH_CR_LOCK;
#if defined(MCU_STM32F1_XL)
    FLASH->CR2 = FLASH_CR_LOCK;
#endif
    return rs;
}

/*!
 * \brief Program any data to FLASH.
 *
 * This function writes data from source address to FLASH. Write to
 * configuration area, if configured, is denied.
 *
 * \param dst Pointer to address anywhere in FLASH. Must be word
 *        aligned
 * \param src Pointer to source data. With SRC == NULL, the region
 *        is checked for write protection
 * \param len Number of bytes to be written/checked. Must be even.
 *
 * \return FLASH Status: FLASH_COMPLETE or appropriate error.
 */
FLASH_Status IapFlashWrite( void* dst, const void* src, size_t len,
                            FLASH_ERASE_MODE mode)
{
    size_t iap_flash_end = FlashEnd();
#if defined(NUT_CONFIG_STM32_IAP) && FLASH_CONF_SIZE > FLASH_PAGE_SIZE
    iap_flash_end -= FLASH_CONF_SIZE ;
#elif defined(NUT_CONFIG_STM32_IAP)
    iap_flash_end -= FLASH_PAGE_SIZE ;
#endif
    if (len == 0)
        return FLASH_COMPLETE;

    /* Check top boundary */
    if ((((uint32_t)dst + len - 1) > iap_flash_end ) || ((uint32_t)dst < FLASH_BASE))
    {
        return FLASH_BOUNDARY;
    }
    return FlashWrite(dst, src, len, mode);
}

/*!
 * \brief Get Upper limit of Flash.
 *
 * This function writes data from source address to FLASH. Write to
 * configuration area, if configured, is denied.
 *
 * \param NONE
 * \return Last Flash Address.
 */
size_t IapFlashEnd(void)
{
#if defined(NUT_CONFIG_STM32_IAP) && FLASH_CONF_SIZE > FLASH_PAGE_SIZE
    return FlashEnd() - FLASH_CONF_SIZE;
#elif defined(NUT_CONFIG_STM32_IAP)
    return FlashEnd() - FLASH_PAGE_SIZE;
#else
    return FlashEnd();
#endif
}

/*!
 * \brief Get start address in first page above program storage.
 *
 * \param NONE
 * \return Start address in first page above program storage.
 */
extern size_t __end_rom;

size_t IapProgramEnd(void)
{
    size_t program_end = (size_t)&__end_rom;
    program_end +=  FLASH_PAGE_SIZE - 1;
    program_end &=  FLASH_PAGE_MASK;
    return program_end;
}

/*!
 * \brief Return pagesize of given address.
 *
 * \param addr Adress
 * \return Size of current page.
 */
size_t IapPageSize(size_t addr)
{
    return FLASH_PAGE_SIZE;
}

/*!
 * \brief Try to protect/unprotect the requested flash region.
 *
 * \param dst Pointer to address anywhere in FLASH.
 * \param len Length of region in bytes.
 * \param ena 0 disables write protection anything else write-protects.
 *
 * \return FLASH_Status: FLASH_COMPLETE or appropriate error.
 */
FLASH_Status IapFlashWriteProtect(void *dst, size_t len, int ena)
{
    uint32_t page_start, page_end;
    int i;
    FLASH_Status rs = FLASH_COMPLETE;
    uint32_t wrpr = FLASH->WRPR; /* Old write protection state */
    __IO uint16_t *WRP = &OB->WRP0;
    uint32_t iap_flash_end = FlashEnd();

    if (len == 0)
        return FLASH_COMPLETE;

    /* Check boundaries */
    if ((((uint32_t)dst+len) > iap_flash_end ) || ((uint32_t)dst < FLASH_BASE))
    {
        return FLASH_BOUNDARY;
    }

    /* Wait for last operation to be completed */
    rs = FlashWaitReady();
    if(rs != FLASH_COMPLETE)
        return rs;
    /* erase option bytes */
    /* set OPTWRE by wrinting key*/
    FLASH->OPTKEYR = FLASH_KEY1;
    FLASH->OPTKEYR = FLASH_KEY2;
    FLASH->CR = FLASH_CR_OPTER;
    FLASH->CR = FLASH_CR_OPTER | FLASH_CR_STRT;
    rs = FlashWaitReady();
    if(rs != FLASH_COMPLETE)
        return rs;
    FLASH->CR = FLASH_CR_OPTPG;
    OB->RDP = RDP_KEY;

    page_start = ((uint32_t)dst          - FLASH_BASE)/FLASH_PAGE_SIZE;
    page_end = (((uint32_t)dst + len -1) - FLASH_BASE)/FLASH_PAGE_SIZE;

    rs = FlashWaitReady();
#if  FLASH_PAGE_SIZE  == 1024
    for (i = page_start>>2; i <= page_end>>2; i++)
#else
    for (i = page_start>>1; i <= page_end>>1; i++)
#endif
    {
        if (i < 31) {
            if (ena)
                wrpr &= ~(1<<(i));
            else
                wrpr |=  (1<<(i));
        }
        /* If one high page is write protected, protect all high pages*/
        else if (ena) wrpr &= ~0x80000000;
    }
#if defined (MCU_STM32F1_LD) || defined (MCU_STM32F1_LD_VL)
    for(i = 0; i < 1 && rs == FLASH_COMPLETE; i++)
#else
    for(i = 0; i < 4 && rs == FLASH_COMPLETE; i++)
#endif
    {
        uint8_t val =  (wrpr>>(8*i) && 0xff);
        uint16_t pval =  ~val<<8 |val;

        if (val == 0xff)
            continue;
        rs = FlashWaitReady();
        if(rs != FLASH_COMPLETE)
            break;
        *WRP++ = pval;
    }
    rs = FlashWaitReady();
    FLASH->CR = 0;
    return rs;
}
/*!
 * \brief Nut/OS specific handling for parameters in FLASH.
 *
 * This function enables to read system specific parameters
 * from processors FLASH. The sectors used for storage are
 * configureable via nutconf.
 *
 * If multiple FLASH_CONF_SIZE fit into the FLASH_PAGE_SIZE,
 * implement a rolling scheme. The first FLASH_CONF_SIZE unit
 * in FLASH_PAGE_SIZE with with the uppermost word erased is
 * considered valid.
 *
 * \param pos Offset of parameter(s) in configured page(s).
 * \param data Pointer where to copy data from flash to.
 * \param len Number of bytes to be copied.
 *
 * \return FLASH_Status: FLASH_COMPLETE or appropriate error.
 */
FLASH_Status Stm32FlashParamRead(uint32_t pos, void *data, size_t len)
{
    uint32_t flash_conf_sector = FlashEnd() & FLASH_PAGE_MASK;

    if (FLASH_CONF_SIZE > FLASH_PAGE_SIZE)
        return FLASH_ERR_CONF_LAYOUT;
#if defined(FLASH_CONF_SIZE) && (FLASH_CONF_SIZE << 1) <= FLASH_PAGE_SIZE
/* More than one FLASH_CONF_SIZE sectors fit into one FLASH_PAGE_SIZE */

    uint8_t  conf_page = 0;
    uint16_t marker = *(uint16_t*) (flash_conf_sector + ((conf_page + 1)  * FLASH_CONF_SIZE) - FLASH_ACCESS_SIZE);

    if (len == 0)
        return FLASH_COMPLETE;

    /* Check boundaries */
    if (pos + len + FLASH_ACCESS_SIZE > FLASH_CONF_SIZE)
    {
        return FLASH_CONF_OVERFLOW;
    }

