l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/stm/stm32f1_3_flash.c
    /* Find configuration page in CONF_SECTOR*/
    while ((marker !=  ERASED_PATTERN_16) && (conf_page < ((FLASH_PAGE_SIZE/FLASH_CONF_SIZE) - 1 ))) {
        conf_page++;
        marker = *(uint32_t*)(flash_conf_sector + ((conf_page + 1)* FLASH_CONF_SIZE) - FLASH_ACCESS_SIZE);
    }
    if (marker !=  ERASED_PATTERN_16)
        /* no page sizes unit in CONF_SECTOR has a valid mark */
        return FLASH_ERR_CONF_LAYOUT;

    memcpy( data, (uint8_t *)((uint8_t*)flash_conf_sector + conf_page * FLASH_CONF_SIZE + pos), len);
#else
    /* FLASH_CONF size and FLASH page size are the same */
    if (len == 0)
        return FLASH_COMPLETE;

    /* Check boundaries */
    if (pos + len > FLASH_PAGE_SIZE)
    {
        return FLASH_CONF_OVERFLOW;
    }

    memcpy( data, (uint8_t *)((uint8_t*)flash_conf_sector + pos), len);
#endif

    /* Return success or fault code */
    return FLASH_COMPLETE;
}

/*!
 * \brief Nut/OS specific handling for parameters in FLASH.
 *
 * This function enables to store system specific parameters
 * in processors FLASH. The sectors used for storage are
 * configurable via nutconf.
 *
 * If multiple FLASH_CONF_SIZE fit into FLASH_PAGE_SIZE,
 * implement a rolling scheme. The first FLASH_CONF_SIZE unit
 * in FLASH_PAGE_SIZE with with the uppermost word erased is
 * considered valid.
 *
 * \param pos Offset of parameter(s) in configured page(s).
 * \param data Pointer to source data.
 * \param len Number of bytes to be written.
 *
 * \return FLASH_Status: FLASH_COMPLETE or appropriate error.
 */
FLASH_Status Stm32FlashParamWrite(unsigned int pos, const void *data,
                                  size_t len)
{
    FLASH_Status rs = 0;
    uint8_t *buffer;
    void* flash_conf_sector = (void*)(FlashEnd() & FLASH_PAGE_MASK);
    int i;
    uint8_t  *mem, *src;
    if(FLASH_CONF_SIZE > FLASH_PAGE_SIZE)
        return FLASH_ERR_CONF_LAYOUT;
#if defined(FLASH_CONF_SIZE) && (FLASH_CONF_SIZE << 1) <= FLASH_PAGE_SIZE
/* More than one FLASH_CONF_SIZE sectors fit into one FLASH_PAGE_SIZE */
    uint8_t  conf_page = 0;
    uint16_t marker = *(uint16_t*) (flash_conf_sector + ((conf_page +1) * FLASH_CONF_SIZE) - FLASH_ACCESS_SIZE);
    FLASH_ERASE_MODE mode;

    if (len == 0)
        return FLASH_COMPLETE;

    /* Check top boundaries */
    if (pos + len + FLASH_ACCESS_SIZE > FLASH_CONF_SIZE)
    {
        return FLASH_BOUNDARY;
    }

    /* Find configuration page in CONF_SECTOR*/
    while ((marker !=  ERASED_PATTERN_16) && conf_page < ((FLASH_PAGE_SIZE/FLASH_CONF_SIZE) -1)) {
        conf_page++;
        marker = *(uint16_t*)(flash_conf_sector + ((conf_page + 1)* FLASH_CONF_SIZE) - FLASH_ACCESS_SIZE);
    }
    if (marker !=  ERASED_PATTERN_16) {
        /* no page sizes unit in CONF_SECTOR has a valid mark
         * Erase Sector and write provided data to position at first sector */

        rs = FlashWrite( flash_conf_sector + pos, data, len, FLASH_ERASE_ALWAYS);
        /* Return success or fault code */
        return rs;
    }

    /* Check if target area is erased.
     * It seems no C standard function provides this functionality!
     */
    mem = (uint8_t*) (flash_conf_sector + conf_page * FLASH_CONF_SIZE + pos);
    src = (uint8_t*) data;
    for (i = 0; i < len; i++) {
        if ((mem[i] != 0xff) && (mem[i] != src[i]))
            break;
    }
    if (i >= len) {
        /* Needed area is erased, simply write the data to the requested area*/
        rs = FlashWrite( flash_conf_sector + conf_page * FLASH_CONF_SIZE + pos, data, len, FLASH_ERASE_NEVER);
        return rs;
    }

    /* Check if content needs no update. */
    if (memcmp(flash_conf_sector + conf_page * FLASH_CONF_SIZE + pos, data, len) == 0)
        return FLASH_COMPLETE;

    /* Save configuration page in RAM and write updated data to next configuration page,
     * eventually erasing the sector wrapping to the first page
     */
    buffer = NutHeapAlloc(FLASH_CONF_SIZE);
    if (buffer == NULL)
    {
        /* Not enough memory */
        return FLASH_OUT_OF_MEMORY;
    }
    /* Get the content of the whole config page*/
    memcpy( buffer, flash_conf_sector + conf_page * FLASH_CONF_SIZE , FLASH_CONF_SIZE);
    /* Overwrite new data region*/
    memcpy (buffer + pos, data, len);
    conf_page++;
    mode = FLASH_ERASE_NEVER;
    if (conf_page < FLASH_PAGE_SIZE/FLASH_CONF_SIZE) {
        uint16_t indicator = (uint16_t)~ERASED_PATTERN_16;
        rs = FlashWrite( flash_conf_sector + conf_page * FLASH_CONF_SIZE - sizeof(indicator),
                         &indicator, sizeof(indicator), FLASH_ERASE_NEVER);
    }
    else {
         /* All pages used, mark the sector as not yet erases to force erase*/
        FlashUntouch();
        conf_page = 0;
        mode = FLASH_ERASE_ALWAYS;
    }
    rs = FlashWrite( flash_conf_sector + conf_page * FLASH_CONF_SIZE , buffer, FLASH_CONF_SIZE, mode);
#else
    /* FLASH_CONF size and FLASH page size are the same */
    /* Check top boundaries */
    if (pos + len > FLASH_PAGE_SIZE)
    {
        return FLASH_BOUNDARY;
    }
    /* Check if target area is erased.
     * It seems no C standard function provides this functionality!
     */
    mem = (uint8_t*) (flash_conf_sector + pos);
    src = (uint8_t*) data;
    for (i = 0; i < len; i++) {
        if ((mem[i] != 0xff) && (mem[i] != src[i]))
            break;
    }
    if (i >= len) {
        /* Needed area is erased, simply write the data to the requested area*/
        rs = FlashWrite( flash_conf_sector + pos, data, len, FLASH_ERASE_NEVER);
        return rs;
    }
    buffer = NutHeapAlloc(FLASH_CONF_SIZE);
    if (buffer == NULL)
    {
        /* Not enough memory */
        return FLASH_OUT_OF_MEMORY;
    }
    /* Get the content of the whole config page*/
    memcpy( buffer, flash_conf_sector , FLASH_PAGE_SIZE);
    /* Overwrite new data region*/
    memcpy (buffer + pos, data, len);
    rs = FlashWrite( flash_conf_sector, buffer, FLASH_PAGE_SIZE, FLASH_ERASE_ALWAYS);

#endif
    NutHeapFree(buffer);
    /* Return success or fault code */
    return rs;
}
